&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Для Инд = 1 По 10 Цикл
			НоваяСтрока = Объект.ТабличнаяЧасть.Добавить();
			НоваяСтрока.Реквизит1 = Инд;
			НоваяСтрока.Реквизит2 = СтрШаблон("Значение %1", Инд);
		КонецЦикла;
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	ОбновитьУсловноеОформление();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ОбновитьУсловноеОформление();
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	ПостроительУО = МОД_ОбщегоНазначения.НовыйПостроительУсловногоОформления(УсловноеОформление);
	
	ПостроительУО.Добавить("Выдаление реквизита 2")
		.УстановитьСвойство("Представление", "Проверка")
		.Оформление("ЦветФона", WebЦвета.ЛососьСветлый)
		.ОтборЗначение("Объект.ТабличнаяЧасть.Реквизит1", 1)
		.Поля("Реквизит2", "ТабличнаяЧасть");

	ПостроительУО.Добавить()
		.Оформление("ЦветФона", WebЦвета.СветлоЗеленый)
		.Отбор("Объект.ТабличнаяЧасть.Реквизит1", ВидСравненияКомпоновкиДанных.Равно, 2)
		.Поля("Реквизит2", "ТабличнаяЧасть");

	ПостроительУО.Добавить()
		.Оформление("ЦветФона", WebЦвета.СеребристоСерый)
		.ГруппаОтборов("ИЛИ")
			.ОтборЗначение("Объект.ТабличнаяЧасть.Реквизит1", 3)
			.ОтборЗначение("Объект.ТабличнаяЧасть.Реквизит1", 4)
			.Условие(Ложь)
				.ОтборЗначение("Объект.ТабличнаяЧасть.Реквизит1", 5)
				.КонецУсловия()
			.КонецГруппы()
		.Поля("Реквизит2", "ТабличнаяЧасть");

	ПостроительУО.Добавить()
		.Оформление("ТолькоПросмотр", Истина)
		.Отбор("Объект.ТабличнаяЧасть.Реквизит1", ВидСравненияКомпоновкиДанных.Равно, 6)
		.Поля("*", Элементы.ТабличнаяЧастьГруппа1);
		
	ПостроительУО.Добавить()
		.Оформление("ТолькоПросмотр", Истина)
		.Отбор("Объект.ТабличнаяЧасть.Реквизит1", ВидСравненияКомпоновкиДанных.Равно, 7)
		.Поля(Элементы.ТабличнаяЧасть);

	ПостроительУО.Добавить()
		.Оформление("ТолькоПросмотр", Истина)
		.Отбор("Объект.ТабличнаяЧасть.Реквизит1", ВидСравненияКомпоновкиДанных.Равно, 8)
		.Поля("*,-%Группа1.*", Элементы.ТабличнаяЧасть);
КонецПроцедуры

&НаСервере
Процедура ОбновитьУсловноеОформление()
	ПостроительУО = МОД_ОбщегоНазначения.НовыйПостроительУсловногоОформления(УсловноеОформление, "ДеньНедели", Истина);

	ПостроительУО.Добавить()
		.Оформление("Шрифт", Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста, , , Истина))
		.ОтборЗначение("Объект.ТабличнаяЧасть.Реквизит1", ДеньНедели(Объект.Дата))
		.Поля("ТабличнаяЧасть");
КонецПроцедуры
