// Создание и инициализация построителя условного оформления
// 
// Параметры:
//  УсловноеОформление - УсловноеОформлениеКомпоновкиДанных - Условное оформление
//  Разделитель - Строка - Разделитель для новых элементов
//  УдалитьСуществующие - Булево - Удаление существующих элементов
// 
// Возвращаемое значение:
//  ОбработкаОбъект.МОД_ПостроительУсловногоОформления - Объект построителя
Функция НовыйПостроительУсловногоОформления(УсловноеОформление, Разделитель = Неопределено, УдалитьСуществующие = Ложь) Экспорт
	Возврат Обработки.МОД_ПостроительУсловногоОформления.Создать().Инициализация(УсловноеОформление, Разделитель, УдалитьСуществующие);
КонецФункции